app/controllers/members_controller.rb

  def create
    @member = Member.new(member_params)

    if @member.save
---
INSERT INTO "members" ("created_at", "email", "job_title", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @members = Member.all
    @member = Member.find(params[:id])
---
SELECT "members".* FROM "members"
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "1"]]