app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 21 Apr 2014 19:56:09 UTC +00:00], ["email", "daddy@daddy.com"], ["name", "daddy"], ["updated_at", Mon, 21 Apr 2014 19:56:09 UTC +00:00]]
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "users".* FROM "users"
---
  def show
    @user = User.find(params[:id])
    @users = User.all